# Практика
# Часть 4. Списки

# 3. Дан список [«a», «s», «1», «a», «32», «23»].
# Разбейте его на два списка: только с буквами и только с числами.
L = ["a", "s", "1", "a", "32", "23"]
letters = [L[0], L[1], L[3]]
digits = [L[2], L[4], L[5]]

if __name__ == "__main__":
    print(f"Список букв: {letters}")
    print(f"Список чисел: {digits}")