# Практика:

# 3. Напишите программу для подсчета среднего числа всех введенных пользователем чисел.
# Ввод пользователя должен осуществляться с помощью input.
# Если пользователь вводит ноль, то выводиться на экран среднее значение.
# Используйте цикл while для решения данной задачи
def average_nums_of_list() -> None:
    """Вычисление среднего значения списка чисел"""
    print("Расчет среднего значения списка чисел (введите 0, чтобы завершить список)")
    nums_list = list()
    while True:
        num = input("Введите следующее число списка: ")

        try:
            num = float(num)
        except ValueError:
            print("Ошибка-ввода: введено некорректное значение для числа.")
            continue
        except Exception as e:
            print("Ошибка: что-то пошло не так.", e)
            continue

        if num == 0:
            if nums_list:
                average = sum(nums_list)/len(nums_list)
                print(f"\nБыл введен список: {nums_list}")
                print(f"Среднее значение чисел списка: {average}")
            else:
                print("Список пуст, нельзя посчитать среднее значение.")
            break

        nums_list.append(num)

    print("Завершение работы программы...")

average_nums_of_list()