# Практика:

# 7. Вывести все числа от 1 до 100, которые делятся на 3 без остатка.
def output_range() -> None:
    """Выводит числа от 1 до 100 которые делятся на 3 без остатка."""
    for num in range(3, 101, 3):
        print(num)



output_range()