# Практика:
# Примечание: Во всех задачах данные должны вводится пользователем,
# это можно реализовать с помощью функции input.
# Например, начинаем выполнять первую задачу из блока If Else:
# first_number = int(input(«Введите первое число»))
# second_number = int(input(«Введите второе число»))
# third_number = int(input(«Введите третье число»))
#
# Switch Case
# 6. *** Реализуйте программу калькулятор. На вход подается три значения:
# первое число, второе число и операция (*, /, + или -).
# На выходе должны получить число, после выполнения операции.
def calculator() -> None:
    """Производит операции (*, /, + или -) на двух числах"""
    print("Калькулятор для двух чисел: ")
    f_num = input("Введите 1-ое число: ")
    s_num = input("Введите 2-ое число: ")
    operation = input("Введите операцию (*, /, + или -): ")
    try:
        f_num = float(f_num)
        s_num = float(s_num)
        if not (operation in ["*", "/", "+", "-"] and len(operation) == 1):
            print("Ошибка-ввода: некорректные данные операции")
            return
    except ValueError:
        print("Ошибка-ввода: некорректные данные числовых значений")
        return
    match operation:
        case "*":
            print(f"Результат операции: {f_num * s_num}")
        case "/":
            try:
                print(f"Результат операции: {f_num / s_num}")
            except ZeroDivisionError:
                print("Ошибка-операции: ошибка деления на ноль")
                return
        case "+":
            print(f"Результат операции: {f_num + s_num}")
        case "-":
            print(f"Результат операции: {f_num - s_num}")



calculator()