# Практика:
# Примечание: Во всех задачах данные должны вводится пользователем,
# это можно реализовать с помощью функции input.
# Например, начинаем выполнять первую задачу из блока If Else:
# first_number = int(input(«Введите первое число»))
# second_number = int(input(«Введите второе число»))
# third_number = int(input(«Введите третье число»))

# If Else
# 5. Даны координаты точки, не лежащей на координатных осях OX и OY.
# Определить номер координатной четверти, в которой находится данная точка.
# Координаты задаются пользователем, например (10, 15).
def get_point_quadrant() -> None:
    """Определение номера координатной четверти в которой находится точка"""
    print("Определение номера координатной четверти в которой находится точка:")
    x = input("Введите координаты точки: x = ")
    y = input("Введите координаты точки: y = ")
    try:
        x = int(x)
        y = int(y)
    except ValueError:
        print("Ошибка-ввода: Не все значения являются целыми числами")
        return

    # Проверка на оси
    if x == 0 or y == 0:
        print("Точка лежит на осях OX или OY.")
        return

    # Определение четверти
    if x > 0 and y > 0:
        print("Точка находится в 1-й четверти.")
    elif x < 0 and y > 0:
        print("Точка находится во 2-й четверти.")
    elif x < 0 and y < 0:
        print("Точка находится в 3-й четверти.")
    elif x > 0 and y < 0:
        print("Точка находится в 4-й четверти.")



if __name__ == "__main__":
    get_point_quadrant()