# Практика:
# Примечание: Во всех задачах данные должны вводится пользователем,
# это можно реализовать с помощью функции input.
# Например, начинаем выполнять первую задачу из блока If Else:
# first_number = int(input(«Введите первое число»))
# second_number = int(input(«Введите второе число»))
# third_number = int(input(«Введите третье число»))
#
# Switch Case
# 4. Робот может перемещаться в четырех направлениях («С» — север, «З» — запад, «Ю» — юг, «В» — восток)
# и принимать три цифровые команды: 0 — продолжать движение,
# 1 — поворот налево, −1 — поворот направо.
# Дан символ C — исходное направление робота и целое число N — посланная ему команда.
# Вывести направление робота после выполнения полученной команды.
def get_new_direction() -> None:
    """Выводит направление робота после выполнения полученной команды"""
    print("Рассчитываем направление робота после выполнения команды:")
    print("(«С» — север, «З» — запад, «Ю» — юг, «В» — восток)")
    print("(0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.)")
    print("(2 - для выхода из программы)")
    c = input("Введите исходное направление робота: ").upper()
    while True:
        n = input("Введите команду: ")

        try:
            n = int(n)
        except ValueError:
            print("Ошибка-ввода: значения не соответствуют типам")
            return

        match (c, n):
            case (_, 0): # Продолжаем движение
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 0 — продолжать движение")
            case ("С", 1): # Поворот налево (С-З)
                c = "З"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 1 — поворот налево")
            case ("З", 1):  # Поворот налево (З-Ю)
                c = "Ю"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 1 — поворот налево")
            case ("Ю", 1):  # Поворот налево (Ю-В)
                c = "В"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 1 — поворот налево")
            case ("В", 1):  # Поворот налево (В-С)
                c = "С"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 1 — поворот налево")
            case ("С", -1): # Поворот направо (С-В)
                c = "В"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: −1 — поворот направо")
            case ("В", -1):  # Поворот направо (В-Ю)
                c = "Ю"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: −1 — поворот направо")
            case ("Ю", -1):  # Поворот направо (Ю-З)
                c = "З"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: −1 — поворот направо")
            case ("З", -1):  # Поворот направо (З-С)
                c = "С"
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: −1 — поворот направо")
            case (c, 2):
                print(f"Текущее направление: {c}")
                print(f"Последняя команда: 2 — выход из программы")
                print("Завершение работы программы...")
                break
            case _:
                print("Ошибка: неподдерживаемая комбинация команды и направления\n")
                break



if __name__ == "__main__":
    get_new_direction()