import pytest
from If_else_conditions_4.task_9 import get_new_direction



def test_get_new_direction_simulation():
    commands = [0, 1, 0, -1, 2]
    result = get_new_direction("С", commands)
    expected = [
        "Текущее направление: С",
        "Последняя команда: 0 — продолжать движение",
        "Текущее направление: З",
        "Последняя команда: 1 — поворот налево",
        "Текущее направление: З",
        "Последняя команда: 0 — продолжать движение",
        "Текущее направление: С",
        "Последняя команда: −1 — поворот направо",
        "Текущее направление: С",
        "Последняя команда: 2 — выход из программы",
        "Завершение работы программы..."
    ]
    assert result == expected