# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 2. Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
from typing import Union

def num_is_uneven(num: Union[int, float]) -> bool:
    try:
        a = int(num)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    return a % 2 != 0



if __name__ == "__main__":
    pass