# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 7. Даны три целых числа: A, B, C. Проверить истинность высказывания: «Число B находится между числами A и C».
from typing import Union

def check_inequalities(num1: Union[int, float],
                       num2: Union[int, float],
                       num3: Union[int, float]) -> bool:
    try:
        a = int(num1)
        b = int(num2)
        c = int(num3)
    except TypeError:
        raise TypeError("Значения не являются целыми числами!")
    except ValueError:
        raise ValueError("Значения не могут быть преобразованы в числа (значения)!")
    return a < b < c or a > b > c



if __name__ == "__main__":
    pass