# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 9. Даны два целых числа: A, B. Проверить истинность высказывания: «Хотя бы одно из чисел A и B нечетное».
from typing import Union

def in_nums_are_uneven(num1: Union[int, float],
                       num2: Union[int, float],) -> bool:
    try:
        a = int(num1)
        b = int(num2)
    except TypeError:
        raise TypeError("Значения не являются целыми числами!")
    except ValueError:
        raise ValueError("Значения не могут быть преобразованы в числа (значения)!")
    return a % 2 != 0 or b % 2 != 0


if __name__ == "__main__":
    pass