# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 6. Даны три целых числа: A, B, C. Проверить истинность высказывания: «Справедливо двойное неравенство A < B < C».
A = input("Введите целое число: A = ")
B = input("Введите целое число: B = ")
C = input("Введите целое число: C = ")

try:
    A = int(A)
    B = int(B)
    C = int(C)
    print("Справедливо двойное неравенство A < B < C", A < B < C)
except ValueError:
    print("Ошибка: Введенные числа не являются целыми")