# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 5. Даны два целых числа: A, B. Проверить истинность высказывания: «Справедливы неравенства A ≥ 0 или B < −2».
A = input("Введите целое число: A = ")
B = input("Введите целое число: B = ")

try:
    A = int(A)
    B = int(B)
    print("Справедливы неравенства A ≥ 0 или B < −2", A >= 0 or B < -2)
except ValueError:
    print("Ошибка: Введенные числа не являются целыми")