# Практика
# Часть 3. Во всех заданиях данной группы требуется вывести логическое значение True,
# если приведенное высказывание для предложенных исходных данных является истинным,
# и значение False в противном случае. Все числа, для которых указано количество цифр
# (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

# 1. Дано целое число A. Проверить истинность высказывания: «Число A является положительным».
A = input("Введите целое число: A = ")

try:
    A = int(A)
    print("Число A является положительным:", A > 0)
except ValueError:
    print("Ошибка: Введенное число не является целым")