# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 4. Дан диаметр окружности d. Найти ее длину{{L = π·d, π = 3.14}}
pi = 3.14
d = input("Введите диаметр окружности: d = ")
try:
    d = float(d)
    L = pi * d
    print(f"Длина окружности равна: L = {L}")
except ValueError:
    print("Ошибка: Введенное значение не является вещественным числом!")