# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 6. Даны длины ребер a, b, c прямоугольного параллелепипеда.
# Найти его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c)
a = input("Введите длины ребер прямоугольного параллелепипеда: a = ")
b = input("Введите длины ребер прямоугольного параллелепипеда: b = ")
c = input("Введите длины ребер прямоугольного параллелепипеда: c = ")
try:
    a = float(a)
    b = float(b)
    c = float(c)
    V = a * b * c
    S = 2 * (a * b + b * c + a * c)
    print(f"Объем и площадь поверхности параллелепипеда: V = {V}, S = {S}")
except ValueError:
    print("Ошибка: Введенные значения не являются вещественным числами!")