# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 5. Дана длина ребра куба a. Найти объем куба V = a3 и площадь его поверхности S = 6·a2
a = input("Введите длину ребра куба: a = ")
try:
    a = float(a)
    V = a ** 3
    S = 6 * a ** 2
    print(f"Объем куба и его площадь равны: V = {V}, S = {S}")
except ValueError:
    print("Ошибка: Введенное значение не является вещественным числом!")