# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 1. Дана сторона квадрата a. Найти его периметр P = 4·a
a = input("Введите длину стороны квадрата: a = ")
try:
    a = float(a)
except ValueError:
    print("Ошибка: Введенное значение не является вещественным числом!")
perimeter = 4 * a
print(f"Периметр квадрата равен: P = {perimeter}")