# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 3. Дан размер файла в байтах.
# Используя операцию деления нацело, найти количество полных
# килобайтов, которые занимает данный файл (1 килобайт = 1024 байта).
def get_full_kilobytes_size(byte_size: int) -> int:
    try:
        file_size = int(byte_size)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if file_size < 0:
        raise ValueError("Значение не может быть отрицательным числом!")
    fk_size = file_size // 1024
    return fk_size



if __name__ == "__main__":
    pass