# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 10. Дано трехзначное число. Вывести вначале его последнюю цифру (единицы), а затем — его среднюю цифру (десятки).
def extract_units_and_tens(num: int) -> tuple[int,int]:
    try:
        a = int(num)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if not 100 <= abs(a) <= 999:
        raise ValueError("Значение не является трехзначным числом!")
    units = abs(a) % 10
    tens = (abs(a) // 10) % 10
    return units, tens



if __name__ == "__main__":
    pass