# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 6. Дано двузначное число.
# Вывести вначале его левую цифру (десятки), а затем — его правую цифру (единицы).
# Для нахождения десятков использовать операцию деления нацело,
# для нахождения единиц — операцию взятия остатка от деления.
def split_two_digit_number(num: int) -> tuple[int, int]:
    try:
        a = int(num)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if not 10 <= abs(a) <= 99:
        raise ValueError("Значение не является двузначным числом!")
    units = abs(a) % 10
    tens = abs(a) // 10
    return tens, units



if __name__ == "__main__":
    pass