# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 1. Дано расстояние L в сантиметрах. Используя операцию деления нацело,
# найти количество полных метров в нем (1 метр = 100 см).
def get_full_meters(length: int) -> int:
    try:
        l = int(length)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if l < 0:
        raise ValueError("Значение не может быть отрицательным числом!")
    fm = l // 100
    return fm



if __name__ == "__main__":
    pass