# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 9. Дано трехзначное число. Используя одну операцию деления нацело, вывести первую цифру данного числа (сотни).
def get_hundreds(num: int) -> int:
    try:
        a = int(num)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if not 100 <= abs(a) <= 999:
        raise ValueError("Значение не является трехзначным числом!")
    hundreds = abs(a) // 100
    return hundreds



if __name__ == "__main__":
    pass