# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 2. Дана масса M в килограммах.
# Используя операцию деления нацело, найти количество полных тонн в ней (1 тонна = 1000 кг).
def get_full_tons(mass: int) -> int:
    try:
        m = int(mass)
    except TypeError:
        raise TypeError("Значение не является целым числом!")
    except ValueError:
        raise ValueError("Значение не может быть преобразовано в число (значение)!")
    if m < 0:
        raise ValueError("Значение не может быть отрицательным числом!")
    ft = m // 1000
    return ft



if __name__ == "__main__":
    pass