# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 9. Даны два неотрицательных числа a и b. Найти их среднее геометрическое, т. е. квадратный корень из их произведения: (a·b)1/2
a = input("Введите два неотрицательных числа: a = ")
b = input("Введите два неотрицательных числа: b = ")

try:
    a = float(a)
    b = float(b)

    if a < 0 or b < 0:
        print("Ошибка: В введенных значения есть отрицательные числа!")
        exit()

    gm = (a * b) ** (1/2)
    print(f"Среднее геометрическое чисел равно: gm = {gm}")
except ValueError:
    print("Ошибка: Введенные значения не являются вещественным числами!")

