# Практика
# Часть 1. Все входные и выходные данные в заданиях этой группы являются вещественными числами.

# 2. Дана сторона квадрата a. Найти его площадь{{S = a2}}
a = input("Введите длину стороны квадрата: a = ")
try:
    a = float(a)
except ValueError:
    print("Ошибка: Введенное значение не является вещественным числом!")
S = a ** 2
print(f"Площадь квадрата равна: S = {S}")