# Практика
# Часть 6. Дополнительно

# 2. Найдите и скопируйте алгоритм пузырьковой сортировки. Запустите код и попробуйте разобраться как он работает
def bubble_sort(arr):
    n = len(arr)  # Длина списка

    # Внешний цикл — количество проходов по списку
    for i in range(n):
        # Внутренний цикл — сравнение соседних элементов
        for j in range(0, n - i - 1):
            # Если текущий элемент больше следующего — меняем местами
            if arr[j] > arr[j + 1]:
                arr[j], arr[j + 1] = arr[j + 1], arr[j]  # обмен значениями

    return arr  # Возвращаем отсортированный список



if __name__ == "__main__":
    my_list = [5, 2, 9, 1, 5, 6]
    sorted_list = bubble_sort(my_list)
    print(sorted_list)  # Выведет: [1, 2, 5, 5, 6, 9]


# Многократное попарное сравнение соседних элементов и обмен местами, чтобы "всплывали" самые большие (или самые маленькие) элементы в конец списка, как пузырьки.