# Практика:

# 8.

# По ссылке находится датасет. Откройте его у себя и ответьте по нему на несколько вопросов.
#
# Каков размер датасета? Значения x и y разделите пробелом
# Какая доля всех значений пропущена? (Округлите до сотых, в качестве разделителя используйте точку)
# Какой самый частый тип данных у столбцов?
# Все ответы округлите до сотых, в качестве разделителя используйте точку. В поле для ответа запишите ответы на вопросы сверху, разделенные символом «;». Если ответы равны (24 4), 0.5325533 и int64, то ответ должен выглядеть так: «24 4;0.53;int64»
import pandas as pd
import pathlib

work_path = pathlib.Path.cwd()
data_path = pathlib.Path(work_path, '../files/task_8', "3.1.3.csv")

def fg():
    pass