# Практика
# Часть 4. Списки

# 2. Дан список [«Ростов», «+», «на», «-», «Дону»]. Исправьте плюс на дефис и выведите
# название города на экран использовав доступ к элементам списка по индексам
def fix_city_name(r: list) -> str:
    r[1] = "-"
    if len(r) < 5:
        raise IndexError("Длина списка должна быть равна 5!")
    else:
        return "".join(r[:5])



if __name__ == "__main__":
    R = ["Ростов", "+", "на", "-", "Дону"]
    R = ["Мало", "+"]
    print(fix_city_name(R))