# Практика
# Часть 4. Списки

# 2. Дан список [«Ростов», «+», «на», «-», «Дону»]. Исправьте плюс на дефис и выведите
# название города на экран использовав доступ к элементам списка по индексам
R = ["Ростов", "+", "на", "-", "Дону"]
R[1] = "-"
print("".join(R[:5]))