# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 4. Даны целые положительные числа A и B (A > B).
# На отрезке длины A размещено максимально возможное количество отрезков длины B (без наложений).
# Используя операцию деления нацело, найти количество отрезков B, размещенных на отрезке A.
A = input("Введите два положительных числа (A > B): A = ")
B = input("Введите два положительных числа (A > B): B = ")
try:
    A = int(A)
    B = int(B)

    if A < B:
        print("Ошибка: A меньше чем B")

    segment_count = A // B
    print(f"Количество отрезков B, размещенных на отрезке A: segment_count = {segment_count}")
except ValueError:
    print("Ошибка: Введенные значения не являются целыми числами!")