# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 9. Дано трехзначное число. Используя одну операцию деления нацело, вывести первую цифру данного числа (сотни).
a = input("Введите трехзначное число: a = ")
try:
    a = int(a)

    if not 100 <= abs(a) <= 999:
        print("Ошибка: Число не является трехзначным!")
        exit()

    hundreds = abs(a) // 100

    print(f"Сотни числа равны: hundreds = {hundreds}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")