# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 10. Дано трехзначное число. Вывести вначале его последнюю цифру (единицы), а затем — его среднюю цифру (десятки).
a = input("Введите трехзначное число: a = ")
try:
    a = int(a)

    if not 100 <= abs(a) <= 999:
        print("Ошибка: Число не является трехзначным!")
        exit()

    units = abs(a) % 10
    tens = (abs(a) // 10) % 10

    print(f"Единицы и десятки числа равны: units = {units}, tens = {tens}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")