# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 1. Дано расстояние L в сантиметрах. Используя операцию деления нацело,
# найти количество полных метров в нем (1 метр = 100 см).
L = input("Введите расстояние в сантиметрах: L = ")
try:
    L = int(L)
    FM = L // 100
    print(f"Количество полных метров равно: FM = {FM}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")