# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 7. Дано двузначное число. Найти сумму и произведение его цифр.
a = input("Введите двузначное число: a = ")
try:
    a = int(a)

    if not 10 <= abs(a) <= 99:
        print("Ошибка: Число не является двузначным!")
        exit()

    units = abs(a) % 10
    tens = abs(a) // 10

    sum = units + tens
    prod = units * tens
    print(f"Сумма и произведение цифр двузначного числа равны: sum = {sum}, prod = {prod}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")