# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 2. Дана масса M в килограммах.
# Используя операцию деления нацело, найти количество полных тонн в ней (1 тонна = 1000 кг).
M = input("Введите массу в килограммах: M = ")
try:
    M = int(M)
    FT = M // 1000
    print(f"Количество полных тонн равно: FT = {FT}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")