# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 6. Дано двузначное число.
# Вывести вначале его левую цифру (десятки), а затем — его правую цифру (единицы).
# Для нахождения десятков использовать операцию деления нацело,
# для нахождения единиц — операцию взятия остатка от деления.
a = input("Введите двузначное число: a = ")
try:
    a = int(a)

    if not 10 <= abs(a) <= 99:
        print("Ошибка: Число не является двузначным!")
        exit()

    units = abs(a) % 10
    tens = abs(a) // 10

    print(f"Десятки и единицы числа равны: units = {units}, tens = {tens}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")