# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 3. Дан размер файла в байтах.
# Используя операцию деления нацело,
# найти количество полных килобайтов, которые занимает данный файл (1 килобайт = 1024 байта).
file_size = input("Введите размер файла в байтах: file_size = ")
try:
    file_size = int(file_size)
    FK_size = file_size // 1024
    print(f"Количество полных килобайтов равно: FK_size = {FK_size}")
except ValueError:
    print("Ошибка: Введенное значение не является целым числом!")