# Практика
# Часть 2. Все входные и выходные данные в заданиях этой группы являются целыми числами.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются положительными.

# 1. Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем (1 метр = 100 см).
a = input("Введите длину стороны квадрата: a = ")
try:
    a = float(a)
except ValueError:
    print("Ошибка: Введенное значение не является вещественным числом!")
P = 4 * a
print(f"Периметр квадрата равен: P = {P}")