# Практика:
# Примечание: Во всех задачах данные должны вводится пользователем,
# это можно реализовать с помощью функции input.
# Например, начинаем выполнять первую задачу из блока If Else:
# first_number = int(input(«Введите первое число»))
# second_number = int(input(«Введите второе число»))
# third_number = int(input(«Введите третье число»))
#
# Switch Case
# 4. Робот может перемещаться в четырех направлениях («С» — север, «З» — запад, «Ю» — юг, «В» — восток)
# и принимать три цифровые команды: 0 — продолжать движение,
# 1 — поворот налево, −1 — поворот направо.
# Дан символ C — исходное направление робота и целое число N — посланная ему команда.
# Вывести направление робота после выполнения полученной команды.
from typing import List

def get_new_direction(start_direction: str, commands: List[int]) -> List[str]:
    """
    Моделирует изменение направления робота.
    start_direction: начальное направление ("С", "З", "Ю", "В")
    commands: список команд (0, 1, -1, 2)
    Возвращает список строк с результатами.
    """
    c = start_direction.upper()
    output = []

    direction_names = {
        "С": "север",
        "З": "запад",
        "Ю": "юг",
        "В": "восток"
    }

    for n in commands:
        if not isinstance(n, int):
            output.append("Ошибка-ввода: значения не соответствуют типам")
            break

        match (c, n):
            case (_, 0):
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 0 — продолжать движение")
            case ("С", 1):
                c = "З"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 1 — поворот налево")
            case ("З", 1):
                c = "Ю"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 1 — поворот налево")
            case ("Ю", 1):
                c = "В"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 1 — поворот налево")
            case ("В", 1):
                c = "С"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 1 — поворот налево")
            case ("С", -1):
                c = "В"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: −1 — поворот направо")
            case ("В", -1):
                c = "Ю"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: −1 — поворот направо")
            case ("Ю", -1):
                c = "З"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: −1 — поворот направо")
            case ("З", -1):
                c = "С"
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: −1 — поворот направо")
            case (c, 2):
                output.append(f"Текущее направление: {c}")
                output.append(f"Последняя команда: 2 — выход из программы")
                output.append("Завершение работы программы...")
                break
            case _:
                output.append("Ошибка: неподдерживаемая комбинация команды и направления\n")
                break

    return output



if __name__ == "__main__":
    print(get_new_direction("С", [1, 1, 1]))