# Практика:
# Примечание: Во всех задачах данные должны вводится пользователем,
# это можно реализовать с помощью функции input.
# Например, начинаем выполнять первую задачу из блока If Else:
# first_number = int(input(«Введите первое число»))
# second_number = int(input(«Введите второе число»))
# third_number = int(input(«Введите третье число»))
#
# Switch Case
# 5. Дано целое число в диапазоне 100–999. Вывести строку-описание данного числа,
# например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».
def num_description(num: int) -> str:
    """Возвращает строку-описание для трехзначного числа"""
    try:
        num = int(num)
    except TypeError:
        raise TypeError("Ошибка-ввода: значение невозможно преобразовать в целое число")
    except ValueError:
        raise ValueError("Ошибка-ввода: значение должно быть целым целым")

    if not (100 <= num <= 999):
        return "Ошибка-ввода: число должно быть в диапазоне 100-999"

    hundreds_dict = {1: "сто", 2: "двести", 3: "триста", 4: "четыреста", 5: "пятьсот",
                6: "шестьсот", 7: "семьсот", 8:"восемьсот", 9: "девятьсот"}
    tens_dict = {1: "десять", 2: "двадцать", 3: "тридцать", 4: "сорок", 5: "пятьдесят",
            6: "шестьдесят", 7: "семьдесят", 8: "восемьдесят", 9: "девяносто"}
    teens_dict = {11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать",
             15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}
    ones_dict = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
            6: "шесть", 7: "семь", 8: "восемь", 9: "девять"}

    hundreds = num // 100
    teens = num % 100
    tens = teens // 10
    ones = teens % 10

    if teens in teens_dict:
        return f"Введенное число: {hundreds_dict[hundreds]} {teens_dict[teens]}"
    elif tens == 0 and ones == 0:
        return f"Введенное число: {hundreds_dict[hundreds]}"
    elif ones == 0:
        return f"Введенное число: {hundreds_dict[hundreds]} {tens_dict[tens]}"
    elif tens == 0:
        return f"Введенное число: {hundreds_dict[hundreds]} {ones_dict[ones]}"
    else:
        return f"Введенное число: {hundreds_dict[hundreds]} {tens_dict[tens]} {ones_dict[ones]}"



if __name__ == "__main__":
    print(num_description(132))