# Практика:

# 5. Напишите программу для вывода таблицы умножения от 0 до 9.
# Используйте вложенный цикл for, print и range
# Пример:
# 0*1 = 0
# 0 *2 = 0
# …..
# 9*1 = 9
# 9*2=18
def output_range() -> None:
    """Выводит числа от 0 до 100 включительно."""
    for digit in range(101):
        print(digit)

output_range()