# Практика:

# 13. Найти факториалы чисел от 1 до 5 (включительно).
# def find_factorial() -> None:
#     """Находит факториалы чисел от 1 до 5 (включительно)."""
#     for digit in range(101):
#         print(digit)
#
#
#
# find_factorial()