# Практика:

# 3. Напишите программу для подсчета среднего числа всех введенных пользователем чисел.
# Ввод пользователя должен осуществляться с помощью input.
# Если пользователь вводит ноль, то выводиться на экран среднее значение.
# Используйте цикл while для решения данной задачи
def averageNums() -> None:
    """Вычисление среднего значения списка чисел"""
    print("Расчет среднего значения списка чисел (введите 0, чтобы завершить список)")
    while True:
        num = input("Введите следующее число списка: ")